[
{
  "champion": "Evelynn",
  "type": "Biography",
  "title": "Evelynn: Agony's Embrace",
  "text": "Within the dark seams of Runeterra, the demon Evelynn searches for her next victim. She lures in prey with the voluptuous façade of a human female, but once a person succumbs to her charms, Evelynn's true form is unleashed. She then subjects her victim to unspeakable torment, gratifying herself with their pain. To the demon, these liaisons are innocent flings. To the rest of Runeterra, they are ghoulish tales of lust gone awry and horrific reminders of the cost of wanton desire.\n\nEvelynn was not always a skilled huntress. She began eons ago, as something primordial, shapeless, and barely sentient. This nascent wisp of shadow existed, numb and unroused by any stimulation, for centuries. It might have remained so, had the world not been upended by conflict. The Rune Wars, as they would come to be known, brought an era of mass suffering the world had never known.\n\nAs people across Runeterra began to experience a vast array of pain, anguish, and loss, the shadow stirred. The nothingness it had known for so long had been replaced by the manic vibrations of an agonized world. The creature quivered with excitement.\n\nAs the Rune Wars escalated, the world's torment grew so intense that the shadow felt as if it might burst. It drank in all of Runeterra's pain, which it experienced as boundless pleasure. The sensation nourished the creature, and over time, it transformed into something more. It became a demon, a ravenous spiritual parasite that fed on the basest of human emotions.\n\nWhen the wars finally ended, the world's suffering waned, and the demon found itself growing desperate. The only pleasure it had ever known was born of other creatures' misery. Without their pain, it felt nothing, just as it had in its earliest days.\n\nIf the world would not provide the suffering the demon needed to thrive, it would have to make its own. It needed to inflict pain on other beings so that it could experience that elation again.\n\nAt first, catching prey was a challenge for the demon. It could move undetected in its shadow form, but to touch a human, the creature needed to manifest as something tangible. It made several attempts to fashion a physical body from its shadow-flesh, but each result was more monstrous than the last, scaring off her prey.\n\nThe demon realized it needed a shape that was pleasing to humans, one that would not only lure them right into its claws, but would offer them ecstasy born of their own desires, so that their pain would be that much sweeter.\n\nFrom the shadows, it began to study those it sought to prey upon. It tailored its flesh to their liking, learned to say what they wanted to hear, and to walk in a manner they found alluring.\n\nIn a matter of weeks, the demon had perfected her physique, leading dozens of enamored victims to be tortured to death at her hands. Though she relishes the exquisite pain of each of her victims, she always finds herself wanting more. Each human's desires are so small, and they always expire too soon. Their pain, too fleeting to give her anything more than tiny morsels of pleasure, is just enough to tide her over to the next feeding.\n\nShe yearns for the day she can plunge the world into utter chaos, and she can return to an existence of pure, rapturous ecstasy.",
  "tags": ["Demon", "Shadow", "Rune Wars", "Pain", "Seduction", "Agony", "Torture"],
  "source": "Official League of Legends Universe",
  "relationships": [
    {
      "entity": "Runeterra",
      "type": "Origin",
      "description": "The shadow realm of Runeterra is where Evelynn originated from before becoming a demon."
    }
  ]
},

{
  "champion": "Evelynn",
  "type": "Characteristics",
  "title": "Appearance and Personality",
  "text": "While Evelynn can change her form at will, she often takes the form of a beautiful curvaceous human woman with pink hands and claws, two \"lashers\" resembling twin tails, light blue skin and pink and white hair. This form includes constantly shifting \"clothes\" that show off most of her body.\n\nIn her shadow form, Evelynn's body becomes pitch black, her lashers obtain magenta tips and she sprouts magenta horns.\n\nEvelynn is a predatory demon who finds pleasure in other people's pain. She inflicts pain on others to satisfy her never-ending hunger and to experience pleasure. Although she lures her prey with promises of sexual pleasure, she does not actually engage in the creation of carnal pleasures, probably because she finds no entertainment in it of her own. To close this gap, Evelynn prefers to prey on happy people, because they are the only ones with something to lose. Behind her pretty exterior hides a very sadistic, sarcastic, and hilarious nature; after all, for her, killing seduced victims is exactly the same as a love game for people who really love each other.",
  "tags": ["Appearance", "Personality", "Shadow Form", "Sadistic", "Seductive"],
  "source": "League of Legends Universe",
  "relationships": []
},

{
  "champion": "Evelynn",
  "type": "Abilities",
  "title": "Demonic Abilities",
  "text": "Demon Physiology: Evelynn is a demon, a malevolent spirit that feeds from human emotions. She has no physical form and cannot be harmed by physical weapons (unless it has magical properties). Each demon is linked to a specific emotion, in this case, Evelynn feeds from pain and agony.\n\nEmotional Feeding: Like other demons, Evelynn can feed herself from an specific emotion, in her case pain and agony. By absorbing the agony of others, Evelynn can sustain herself for prolonged periods of time. Evelynn instinctively knows how to make one suffer.\n\nImmortality: So long as agony and pain exists, Evelynn will exist in some form.\n\nShadow Magic: Evelynn is able to use shadows to form anything she desires, mostly used to form spikes to torture her victims.\n\nForm Shift: Being a spirit, Evelynn can shift her form to fit any situation she needs, most often turning herself into a form that makes it easy to seduce people.\n\nInvisibility: Evelynn can turn herself into an almost invisible shadow, visible only by the keenest of onlookers.\n\nSharp Body Parts: Evelynn often uses sharp body parts that she gives herself, such as claws and lashers, to torture and kill the people that she preys on.",
  "tags": ["Demon Physiology", "Emotional Feeding", "Immortality", "Shadow Magic", "Form Shift", "Invisibility"],
  "source": "League of Legends Universe",
  "relationships": []
},

{
  "champion": "Evelynn",
  "type": "Relationships",
  "title": "Champion Connections",
  "text": "Vayne: Evelynn killed Vayne's mother and father, who were the patron and matron of House Vayne of Demacia, in their home. Vayne came home while Evelynn killed them, and got a glimpse of her face. Vayne was scarred from this incident and dedicated her life to finding and destroying monsters, with her ultimate goal being to find Evelynn and take revenge for her mother and father.\n\nTahm Kench: Like Tahm Kench, Evelynn is classified as a demon, and they seem to know each other. She considers him a rival, as both prey on humans and do not consider sharing her food, though their choices of victims are very different.",
  "tags": ["Vayne", "Tahm Kench", "Enemies", "Fellow Demons"],
  "source": "League of Legends Universe",
  "relationships": [
    {
      "entity": "Vayne",
      "type": "Nemesis",
      "description": "Evelynn murdered Vayne's parents, causing Vayne to dedicate her life to hunting monsters with the goal of ultimately killing Evelynn."
    },
    {
      "entity": "Tahm Kench",
      "type": "Fellow Demon",
      "description": "Both are demons who feed on human emotions, though they prefer different emotional sustenance. They have a rivalry and do not share prey."
    },
    {
      "entity": "Nocturne",
      "type": "Similar Entity",
      "description": "Both are manifestations of negative emotions, with Nocturne embodying nightmares while Evelynn embodies agony."
    },
    {
      "entity": "Thresh",
      "type": "Thematic Connection",
      "description": "Both entities derive pleasure from the suffering of others, though Thresh collects souls while Evelynn feeds on pain."
    },
    {
      "entity": "Ahri",
      "type": "Contrasting Seducer",
      "description": "Both use allure to attract victims, but Ahri often regrets taking lives while Evelynn revels in the suffering she causes."
    }
  ]
},

{
  "champion": "Evelynn",
  "type": "Voice Lines",
  "title": "Notable Quotes",
  "entries": [
    {
      "category": "General",
      "lines": [
        "A man once told me to put on some clothes. So I wore his skin.",
        "Their mouths say no, but their bodies say 'flay me alive.'",
        "That skin looks good on you, but it would look better on my bedroom floor.",
        "Rend their flesh, flay them head to toe.",
        "Girls just wanna tear your throat out with their teeth.",
        "What are you doing tonight? How about we get together and unlock that vast well of torment inside you?"
      ]
    },
    {
      "category": "Champion-Specific",
      "lines": [
        "So how are you, River King? I see you haven't missed a meal."
      ],
      "target_champion": "Tahm Kench",
      "relationship_context": "Fellow demon acknowledging their shared nature as feeders on human emotions."
    }
  ],
  "tags": ["Quotes", "Seduction", "Threats", "Violence", "Dark Humor"],
  "source": "In-game Voice Lines"
},

{
  "champion": "Evelynn",
  "type": "Origin Summary",
  "title": "Birth of a Demon",
  "text": "Evelynn is a demon created around the time of the rune wars, while the war was raging there was an enormous amount of agony and suffering which demons like Evelynn could feed on. However when the rune wars were over she couldn't just consume the agony around her and she needed it as it was her form of food, so she needed to figure out a way to get it herself.\n\nShe used the energy she had to create a form that would entice the most amount of souls therefore a hot, sexy lady. Because men think with their dicks, she could bring them in with the idea they were gonna get laid, and right when they are at their peak of happiness she rips it all away to feed on the agony from the most painful thing she could induce.\n\nA demon was born out of all the pain and suffering felt during wars 6,000 years ago. It cannot feel anything. It can only feel pleasure when it causes suffering to humans. It tried taking different forms, such as scary monsters, but the best form it had found was an attractive female facade.\n\nEvelynn comes from the shadows from Runeterra, when the rune wars happened the shadows transformed into a demon. The demon fed from human emotions, but after the war there was nothing to feed from anymore, since there was no more pain and grief. Therefore the demon had to create pain to feel something again. It could move unseen in the shadow and feed from all the fear like that. Now the demon had to get in touch with the humans to create fear. That's why this demon turned into a lady that was attractive for men. She would seduce them and lead them to a shadey ally just to kill them and survive.",
  "tags": ["Origin", "Rune Wars", "Transformation", "Feeding", "Seduction Strategy"],
  "source": "League of Legends Lore Compilation",
  "relationships": []
},

{
  "champion": "Evelynn",
  "type": "Color Story",
  "title": "The Tallest Daisy",
  "text": "Evelynn slinked through the teeming streets, the shadows of her body blending seamlessly with the night. Her eyes glinted within the gloom, though only the keenest observer would have noticed. Drunks, sailors, and harlots chatted in a nearby thoroughfare, blissfully unaware they were being watched by a demon in the dark. The demon, on the other hand, saw them all with perfect clarity, and judged them with the most discerning eye.\n\nEvelynn's gaze settled on a man lying in the gutter, a bottle of beet wine dangling from his hands. Ordinarily, the demon wouldn't give a second thought to someone in his condition. But she had not fed in days, and she found herself desperate enough to consider the man, if only for a moment. It would be so easy. All she needed was to lure him to one of the numerous alleys far from the glow of the street lamps.\n\nThe thought perished as she watched a cockroach scurry across the drunk's face. This was a man too inebriated to feel. His arousal would be vague and muted, with none of the urgent attraction she loved to see in her victims before she brought them low. She might even flay an entire arm before he mustered a scream.\n\nAnd that was the problem. Over the course of countless feedings, Evelynn had learned everything about her palate: She preferred—no, needed—her victims to feel every prick, every bite, every bit of flesh she peeled away with her claws. A man in this condition would be dull and unfulfilling, scarcely worth her time.\n\nShe dismissed the drunk and continued down the muddy promenade, past the windows of a dank, candlelit tavern. A fat, belching woman threw open its door and stumbled out into the night, grasping a half-eaten turkey leg. For a moment, Evelynn considered the woman, how she might woo her into an embrace, and then into the unspeakable hell that would follow.\n\nThe demon watched as the woman wolfed down the rest of the meat, never tasting it. There was something deep inside her, a melancholy that would taint the experience.\n\nEvelynn preferred inflicting the pain herself.\n\nThe demon moved on, gliding through the shadows of the town, over two more drunks, past a beggar asking for alms, between a couple in the midst of an argument. Evelynn found them all completely unappealing. Hurting them would be like plucking a flower that had already wilted. She preferred her daisies tall and healthy, for those were the most satisfying to cut down.\n\nA dreadful thought overtook her. Perhaps she'd made a mistake choosing this wretched backwater as her hunting ground. Perhaps, at any moment, the thrill from her last victim might wear off, leaving only the nothingness—that utterly empty space inside her where feelings should be.\n\nAnd then, she saw him…\n\nThe gentleman was positively beaming as he exited one of the high-end pubs. He was dapper without being flashy, and he hummed a jaunty tune to himself as he set off down the street with a bouquet of flowers tucked gingerly in the fold of his arm.\n\nThe two lashers on Evelynn's back writhed with excitement. Even from a distance, she sensed this man was completely content in his own skin. She dashed after the gentleman, taking great care not to lose track of her prey or to alert him to her presence.\n\nHe walked for nearly half an hour before finally turning up a long walkway toward a modestly sized, cut-stone manor. At the end of the path, the man stepped through the heavy oak door to his home. Evelynn held her unblinking gaze on the windows of the man's house as they lit one by one with warm candlelight. A slender, austere woman in a high-necked evening gown entered and greeted the man with a welcoming embrace. She feigned a slight surprise at the flowers he had brought, before placing them in a clean vase, right next to an old bouquet.\n\nThe demon's interest grew.\n\nA moment later, two children, scarcely out of diapers, ran into the room and threw their arms around the man's legs, their wide grins sparkling with tiny teeth. Though the scene played like the epitome of domestic bliss, Evelynn knew what she would find if she probed just a little deeper.\n\nShe waited patiently, watching the candles go out one by one, until only the parlor remained lit. The man was alone, settling into a reading chair to draw on his pipe. Evelynn crept out of the shadows, her dark, wispy limbs giving way to warm flesh. Her demonic lashers disappeared behind her back, revealing a shapely female form, with curves too generous for any eye to ignore.\n\nHer hips waggled softly as she sauntered across the lawn to the window. She was nearly arm's length from the glass when she saw the man bolt upright from his chair at the sight of her, his pipe nearly falling from his mouth. Evelynn beckoned with a single finger, motioning for the man to join her outside.\n\nThe man crept to the front door and opened it tentatively, curious to investigate the strange beauty lurking outside his window. He approached her on the lawn with great apprehension, and greater anticipation.\n\n\"Who… are you?\" he asked timidly.\n\n\"I'm whatever you want me to be,\" assured the demon.\n\nAs Evelynn locked eyes with the man, she plumbed the depths of his soul and found exactly what she was looking for—that tiny lesion of discontent that festered within even the happiest person.\n\nThere it is, she thought. All that he wants and cannot have.\n\n\"My family…\" the man said, unable to finish his thought.\n\nThe demon leaned close.\n\n\"Shh. It's okay,\" she whispered in the man's ear. \"I know what you want, and the guilt you feel for wanting it. Let it go.\"\n\nShe pulled back to find the man hopelessly captivated.\n\n\"Can I… have you?\" he asked, ashamed of his brazenness, but overcome by a strange desire to take her right there on the lawn.\n\n\"Of course, honey. That's why I'm here,\" said the demon.\n\nHe touched her face with the tips of his fingers, caressing her cheek. She held his hand firmly to her skin and released a soft, sultry chuckle. This sweet, tender, happy man would be hers tonight. He had so much pain to give, and she would take it all.\n\nFrom behind them, the shuffling of slippered feet sounded from the open doorway of the house.\n\n\"Is everything okay, love?\" asked the man's wife.\n\n\"Everything's going to be wonderful, my darling,\" the demon answered for the dumbstruck man.\n\nThe deal had become even sweeter, and the prospects more enticing. There was one daisy in full flower to pluck, and one bulb to bloom while it watched.",
  "tags": ["Hunting", "Seduction", "Predatory", "Victim Selection", "Happy Victims", "Family", "Narrative"],
  "source": "League of Legends Universe",
  "relationships": []
},

{
  "champion": "Evelynn",
  "type": "Recent Events",
  "title": "Cult and Vayne's Pursuit",
  "text": "Evelynn made a cult designed to attract worshipers who would do her bidding. While traveling through Valoran with her teacher Frey, Vayne heard of this and traveled to the meeting place of the cult. Despite being injured by a member of the cult and killing her own teacher on the way, Vayne continued her journey to the meeting place with the intent of finally killing Evelynn.",
  "tags": ["Cult", "Vayne", "Valoran", "Pursuit", "Revenge"],
  "source": "League of Legends Universe",
  "relationships": [
    {
      "entity": "Vayne",
      "type": "Hunter-Prey",
      "description": "Vayne is actively hunting Evelynn to avenge her parents' deaths."
    },
    {
      "entity": "Frey",
      "type": "Connected Character",
      "description": "Vayne's teacher who was killed during Vayne's pursuit of Evelynn."
    }
  ]
},

{
  "champion": "Evelynn",
  "type": "Behavior Analysis",
  "title": "Hunting Patterns and Victim Selection",
  "text": "Evelynn prefers to prey on happy people, because they are the only ones with something to lose. Behind her pretty exterior hides a very sadistic nature; after all, for her, killing seduced victims is exactly the same as a love game for people who really love each other.\n\nUnder this persona, Evelynn is charming and flirty towards her victims, manipulating others towards her doom. She prefers those that live happy lives, and then brings them to the peak of ecstasy so that their agony is more intense, relishing in her cruelty.\n\nOver the course of countless feedings, Evelynn has learned everything about her palate: She prefers—no, needs—her victims to feel every prick, every bite, every bit of flesh she peels away with her claws. Evelynn dismisses potential victims who are already in pain or too inebriated to feel her torture. Hurting them would be like plucking a flower that had already wilted. She prefers her daisies tall and healthy, for those are the most satisfying to cut down.",
  "tags": ["Hunting", "Victim Selection", "Preferences", "Happy Victims", "Seduction", "Torture"],
  "source": "League of Legends Universe Compilation",
  "relationships": []
},
{
  "champion": "Evelynn",
  "type": "Extended History",
  "title": "Shadows Before Form",
  "text": "Long before the Rune Wars, before Evelynn had even the barest whisper of consciousness, she existed as a formless essence within the deepest shadows of Runeterra. In the ancient times when the world was still young, this essence was nothing more than a concentration of the primal darkness that existed between realms. Neither good nor evil, it simply was—a cosmic potential, a void waiting to be filled.\n\nScholars of spirit magic theorize that what would eventually become Evelynn may have originated during the creation of the Spirit Realm itself, a byproduct of the division between the material and spirit worlds. For countless millennia, this shadow-essence drifted aimlessly through the dark corners of existence, occasionally brushing against the emotions of early sentient beings but unable to comprehend or interact with them.\n\nSome accounts from the oldest Iceborn texts speak of ancient Freljordians encountering 'shadow-pools' that seemed to react to extreme emotions—particularly suffering. These could have been early manifestations of the entity that would become Evelynn, drawn to pain even before it had developed consciousness.",
  "tags": ["Pre-History", "Origins", "Spirit Realm", "Ancient Runeterra"],
  "source": "Theoretical Extended Universe",
  "relationships": [
    {
      "entity": "Spirit Realm",
      "type": "Origin Connection",
      "description": "The formless essence that would become Evelynn likely originated from the division between the material and spirit worlds."
    }
  ]
},
{
  "champion": "Evelynn",
  "type": "Extended History",
  "title": "The First Taste of Agony",
  "text": "The entity that would become Evelynn first gained rudimentary awareness during a period of massive bloodshed that preceded the Rune Wars. A conflict between two now-forgotten kingdoms in what would later become Noxian territory created a concentrated wave of suffering so intense that it acted as a catalyst, causing the shadow-essence to coalesce into something more defined.\n\nFor the first time, the proto-Evelynn experienced the faintest echo of pleasure as it passively absorbed the agony radiating from the battlefield. Though barely conscious, it found itself drawn toward the dying and wounded, lingering over the fallen soldiers as they breathed their last, painful breaths.\n\nA young hedge witch, attempting to save her dying brother on that battlefield, sensed the presence of the shadow entity. In desperation, she attempted a forbidden ritual to bind the entity to her will, hoping to use its power to sustain her brother's life. The ritual failed catastrophically. The witch and her brother were consumed, their pain and terror becoming the first direct feeding for the awakening demon. The witch's final screams marked the moment when the entity first recognized itself as separate from the darkness around it—the birth of Evelynn's earliest consciousness.\n\nFor centuries after, the proto-Evelynn existed in a half-aware state, drawn to scenes of torture, execution, and war, but still formless and unable to actively hunt. It could only feed on suffering it happened to encounter, like a scavenger rather than a predator. This would change dramatically with the coming of the Rune Wars.",
  "tags": ["First Consciousness", "Pre-Rune Wars", "Failed Ritual", "First Feeding"],
  "source": "Theoretical Extended Universe",
  "relationships": [
    {
      "entity": "Ancient Noxian Territory",
      "type": "Location of Awakening",
      "description": "The entity that would become Evelynn first gained sentience in the aftermath of a forgotten battle in what would later become Noxian territory."
    }
  ]
},
{
  "champion": "Evelynn",
  "type": "Extended History",
  "title": "Feast of the Rune Wars",
  "text": "While the general history records that Evelynn awakened during the Rune Wars, the specific details of her evolution during this chaotic period reveal a more gradual transformation. As the conflicts involving World Runes escalated, the proto-Evelynn found herself in an environment of unprecedented magical and emotional intensity.\n\nThe arcane devastation wreaked by the World Runes created tears in the fabric between realms, allowing the demon greater access to the material world. Each new atrocity committed with the Runes sent waves of agony through the spiritual landscape that the demon could now more fully experience. The proto-Evelynn began to develop what might be called preferences—certain types of suffering had 'flavors' that were more satisfying than others. In particular, the demon found that personal betrayal, the destruction of hope, and the perversion of love created the most exquisite pain.\n\nAs the wars continued, the demon began manifesting increasingly solid shadow forms near battlefields, though still unable to interact physically with victims. Survivors of Rune War battles reported seeing strange shadow figures feeding on the dying—descriptions that match early forms of Evelynn. One account from an Ionian monastery that was caught in the magical crossfire describes 'a woman made of night' who moved among the wounded, her presence somehow making their suffering more acute before they died.\n\nBy the final years of the Rune Wars, the demon had absorbed enough agony to gain not just awareness but intellect. It could comprehend language, understand complex emotions, and recognize patterns of behavior. Most importantly, it developed desire—no longer content to feed passively, it wanted to actively create the suffering it craved.",
  "tags": ["Rune Wars", "Evolution", "Shadow Forms", "Desire Development"],
  "source": "Theoretical Extended Universe",
  "relationships": [
    {
      "entity": "World Runes",
      "type": "Catalyst",
      "description": "The magical devastation caused by World Runes created conditions that accelerated Evelynn's evolution from shadow essence to demon."
    }
  ]
},
{
  "champion": "Evelynn",
  "type": "Extended History",
  "title": "The First Hunt",
  "text": "When the Rune Wars finally ended, Evelynn's newfound consciousness faced an existential crisis. The abundant suffering that had nourished her was fading, and for the first time, she experienced a gnawing emptiness that could be described as hunger. This period marked her transition from opportunistic feeder to active predator.\n\nEvelynn's first attempts to create her own sources of suffering were crude and animalistic. Unable to fully manifest physically, she could only influence the material world in subtle ways—creating inexplicable shadows that startled travelers on dark roads, generating whispers that drove isolated settlers to paranoia, or causing disturbing dreams that prevented sleep. These minor torments provided minimal sustenance, barely keeping her consciousness intact.\n\nHer breakthrough came in a small village on the outskirts of what would later become Demacia. Taking advantage of local superstitions, Evelynn managed to manifest enough of a shadow presence to convince the villagers that a malevolent spirit was targeting their community. The resulting witch hunt saw neighbor turn against neighbor in a frenzy of accusation and counter-accusation. When the first innocent was executed, the demon experienced a rush of pleasure far more intense than the background suffering of war—pain amplified by betrayal, injustice, and the destruction of community bonds.\n\nThis first successful hunt taught Evelynn a crucial lesson: the suffering she could create through manipulation was far more satisfying than the pain she could inflict directly in her limited form. She needed to evolve further, to develop a physical presence that could interact with humans on their own terms. It was then that she began the long process of crafting her human disguise.",
  "tags": ["First Hunt", "Manipulation", "Shadow Influence", "Witch Hunt", "Evolution Catalyst"],
  "source": "Theoretical Extended Universe",
  "relationships": [
    {
      "entity": "Proto-Demacia",
      "type": "First Hunting Ground",
      "description": "Evelynn's first successful manipulation occurred in a village that would later become part of Demacia, where she instigated a witch hunt that allowed her to feed on the resulting suffering."
    }
  ]
},
{
  "champion": "Evelynn",
  "type": "Extended History",
  "title": "Perfecting the Lure",
  "text": "Evelynn's journey to create the perfect physical form was neither quick nor without failures. Her first attempts to craft a human body were monstrous amalgamations of shadow and flesh that inspired terror rather than desire. These early forms could only lure the most desperate or deranged individuals, limiting her hunting options.\n\nThe demon realized that to create truly exquisite suffering, she needed to understand human desire on a fundamental level. Over decades, she became a student of humanity, watching from the shadows as people loved, betrayed, desired, and rejected one another. She haunted bedchambers and brothels, taverns and ballrooms, observing the intricate dance of human seduction.\n\nShe discovered that different cultures had different standards of beauty, different taboos, and different desires. In Noxus, strength and confidence were prized; in Demacia, elegance and propriety; in Bilgewater, danger and adventure. Evelynn learned to adapt her appearance and mannerisms to exploit regional preferences, becoming a master of cultural seduction.\n\nPerhaps her most important discovery was the power of the forbidden. Humans desired most intensely that which they were denied or that which they knew would bring them ruin. A married merchant would risk everything for a night of passion. A devoted priest would abandon vows for the right temptation. This insight allowed her to refine her hunting technique—identifying those with the most to lose and offering them exactly what they secretly craved.\n\nBy the time Evelynn had perfected her human form, she had developed an encyclopedic knowledge of human desire and weakness. Her physical appearance was only part of her lure; equally important was her ability to sense a person's deepest wants and to present herself as the answer to unspoken prayers. She became not just a predator of bodies, but a hunter of souls, using a victim's own desires as the weapon that would ultimately destroy them.",
  "tags": ["Seduction", "Human Study", "Cultural Adaptation", "Desire Exploitation", "Form Development"],
  "source": "Theoretical Extended Universe",
  "relationships": []
},
{
  "champion": "Evelynn",
  "type": "Extended History",
  "title": "The Cult of Agony's Embrace",
  "text": "The cult that Evelynn established, known to its adherents as \"The Embrace,\" began not as a deliberate creation but as an unexpected development from one of her hunts. A charismatic philosopher in Piltover had survived an encounter with Evelynn where she had been interrupted before completing her feed. The philosopher, forever changed by his brief exposure to her particular blend of pleasure and pain, became obsessed with recapturing that experience.\n\nUnable to find Evelynn again, he began preaching about transcendence through the unity of extreme pleasure and pain. His teachings attracted other sensation-seekers, many from the upper echelons of Piltovan society, bored aristocrats looking for novel experiences beyond what their wealth could typically buy. The philosopher never explicitly mentioned Evelynn, referring instead to \"The Lady of Thorns\" or \"The Midnight Embrace,\" but his descriptions were clear enough to catch the demon's attention.\n\nInitially, Evelynn viewed the cult with amused curiosity. Here were humans willingly seeking the very suffering she inflicted. When she finally revealed herself to the cult, adopting the role of their dark goddess, the philosopher was the first to offer himself to her. His death was slow, public, and horrific—yet the remaining cultists were not deterred. If anything, their devotion intensified.\n\nEvelynn discovered that cultivating the cult offered unique advantages. The cultists served as both larder and camouflage, providing her with a steady supply of willing victims while also helping to cover her tracks. Most importantly, they began to recruit others, specifically targeting the wealthy, the influential, and those with specific skills that might serve their mistress.\n\nThe cult spread beyond Piltover, establishing cells in Noxus and the shadier districts of Demacia. Each cell operated independently, with only the inner circle aware of Evelynn's true nature. To the outer circles, she was a goddess of pleasure who selected the worthy for transcendence. Only when initiated into the inner mysteries did members learn the truth—by which point they were too indoctrinated to flee.\n\nThe Cult of Agony's Embrace remains active in several regions, its members identified by a small tattoo of a thorn-wrapped heart. Their activities range from the recruitment of new victims to the sabotage of investigations into disappearances linked to Evelynn. For the demon, the cult represents both a reliable feeding ground and an amusing diversion—watching humans willingly submit to the doom they once had to be tricked into accepting.",
  "tags": ["Cult", "Willing Victims", "Religious Devotion", "Human Servants", "Piltover", "Noxus", "Demacia"],
  "source": "Theoretical Extended Universe",
  "relationships": [
    {
      "entity": "Piltover",
      "type": "Cult Origin Location",
      "description": "The Cult of Agony's Embrace originated in Piltover among sensation-seeking aristocrats and has since spread to other regions."
    }
  ]
},
{
  "champion": "Evelynn",
  "type": "Extended History",
  "title": "The Shadowbound",
  "text": "Not all of Evelynn's victims die from their encounters with her. A rare few—less than one in a hundred—survive her feeding, though they are irreversibly changed by the experience. These survivors, known in whispered legends as the Shadowbound, carry a fragment of Evelynn's essence within them, a sliver of shadow that can never be removed.\n\nThe Shadowbound experience a profound transformation after their encounter with the demon. They develop an unnatural sensitivity to pain, both their own and others', often able to sense suffering across great distances. Their dreams are haunted by Evelynn, creating a psychological link that allows her to occasionally look through their eyes or influence their perceptions. Most disturbingly, they find themselves drawn to scenes of suffering and may experience echoes of the pleasure that Evelynn derives from pain.\n\nSome Shadowbound go mad from this connection, becoming sadists who inflict suffering in a desperate attempt to recapture the intense sensations they experienced with Evelynn. Others fall into deep depression, unable to reconcile their unwanted connection to the demon. A rare few attempt to use their condition to hunt Evelynn, believing that only by destroying her can they sever the connection and find peace.\n\nThe most famous of the Shadowbound was Magda Seelenfänger, a Noxian monster hunter who tracked Evelynn across Runeterra for twenty years after surviving an encounter that claimed her entire family. Magda developed a unique ability to sense Evelynn's presence through the shadow fragment within her, allowing her to follow the demon's trail across continents. Their final confrontation in the shadow-haunted forests north of the Immortal Bastion has become the subject of numerous ballads. According to the most common version, Magda wounded Evelynn with enchanted silver weapons but ultimately succumbed to the demon's influence, turning her weapons on herself in a final moment of tragic clarity.\n\nEvelynn keeps track of her Shadowbound, occasionally revisiting them years or decades after their initial encounter. To her, they represent interesting experiments—case studies in how humans adapt to carrying a piece of demonic essence. She finds their struggles amusing and their eventual corruption satisfying, additional suffering extracted from what would otherwise be finished meals.",
  "tags": ["Survivors", "Corruption", "Mental Link", "Monster Hunters", "Long-term Effects"],
  "source": "Theoretical Extended Universe",
  "relationships": [
    {
      "entity": "Magda Seelenfänger",
      "type": "Notable Victim",
      "description": "A Noxian monster hunter who survived an encounter with Evelynn and spent twenty years hunting the demon before their final confrontation."
    }
  ]
},
{
  "champion": "Evelynn",
  "type": "Extended Lore",
  "title": "Among the Demon-kin",
  "text": "Among the demon-kind of Runeterra, a complex hierarchy exists based on age, power, and the fundamental emotions they embody. Evelynn occupies a specific niche in this demonic ecosystem, neither the most powerful nor the most ancient, but perhaps one of the most refined in her feeding methods.\n\nThe oldest demons, such as Tahm Kench, tend to embody more primal emotions—addiction, desperation, and greed in the River King's case. These ancient entities are more established and often operate through pacts and agreements, offering something in return for what they ultimately take. Evelynn, by contrast, represents a more sophisticated emotional spectrum centered around agony derived from betrayal and shattered desire. This specialization has allowed her to thrive in civilized regions where the older demons sometimes struggle to adapt to changing human societies.\n\nEvelynn's relationship with other demons is generally one of mutual avoidance. Territorial conflicts between demons are rare but catastrophic when they occur, often resulting in widespread human suffering as collateral damage. A centuries-old accord exists between the major demons of Runeterra, loosely defining hunting grounds and spheres of influence. Evelynn has occasionally violated these boundaries when particularly tempting prey presented itself, leading to tense encounters with other demon-kind.\n\nOne such encounter occurred in Bilgewater nearly a century ago, when Evelynn's pursuit of a wealthy ship captain brought her into conflict with Tahm Kench, who had already marked the man for his own purposes. Their confrontation took place in the captain's dreams over seven consecutive nights, with each demon attempting to lure the man into their particular brand of doom. The captain, driven to madness by the experience, steered his ship onto the jagged rocks of the Serpent Isles, claiming he saw beautiful women dancing among the stone teeth. Neither demon claimed satisfaction from the compromise outcome.\n\nUnlike some demons who have developed almost symbiotic relationships with specific regions or cultures, Evelynn remains a solitary hunter, preferring variety in her feeding grounds. She finds the constraints of consistent feeding patterns to be limiting and enjoys the challenge of adapting her methods to different cultural contexts. This wanderlust has given her a broader understanding of human nature than many of her demon kin, who often become specialized in exploiting specific cultural weaknesses.",
  "tags": ["Demon Hierarchy", "Territorial Conflicts", "Tahm Kench", "Emotional Feeding", "Demonic Accords"],
  "source": "Theoretical Extended Universe",
  "relationships": [
    {
      "entity": "Tahm Kench",
      "type": "Rival Demon",
      "description": "Evelynn and Tahm Kench have occasionally competed for the same victims, leading to confrontations that typically end poorly for the humans involved."
    },
    {
      "entity": "Bilgewater",
      "type": "Conflict Location",
      "description": "Evelynn and Tahm Kench once battled for the soul of a ship captain in Bilgewater, resulting in the man's madness and death."
    }
  ]
},
{
  "champion": "Evelynn",
  "type": "Extended History",
  "title": "Immortal Witnesses",
  "text": "Throughout her long existence, Evelynn has encountered many of Runeterra's immortal or long-lived beings. These encounters, often separated by centuries, have created complicated relationships that transcend typical prey and predator dynamics.\n\nPerhaps most significant among these is her occasional crossing of paths with LeBlanc, the pale woman who leads the Black Rose. Their first meeting occurred shortly after the fall of the ancient Shuriman empire, when LeBlanc was still consolidating her power in what would become Noxus. Recognizing each other's inhuman nature immediately, they circled each other with caution rather than hostility. Unlike most humans, LeBlanc offered no fear for Evelynn to feed upon—only calculated interest.\n\nOver the millennia, they have encountered each other perhaps a dozen times, each meeting marked by veiled conversations and unspoken understandings. While not allies in any meaningful sense, they have occasionally shared information about mutual enemies. LeBlanc once warned Evelynn about a concerted effort by the Illuminators of Demacia to trap and destroy her; in return, Evelynn eliminated a rival mage who had discovered compromising information about the Black Rose's activities.\n\nEvelynn has also had less cordial interactions with Ryze, the arcane scholar whose quest to secure the World Runes has brought him into conflict with many of Runeterra's most dangerous entities. During the aftermath of the Rune Wars, Ryze encountered Evelynn feeding on the survivors of a devastated village. Recognizing her demonic nature, he attempted to banish her using arcane bindings. The resulting battle left Ryze severely wounded and Evelynn temporarily diminished, forced to retreat into the shadow realm to recover her strength. They have clashed sporadically in the centuries since, with neither able to claim decisive victory.\n\nMore recently, Evelynn has developed a wary respect for Vladimir, the hemomancer whose power over blood magic makes him both dangerous prey and a potential rival feeder. While Vladimir's methods differ from hers—he sustains himself through blood rather than pain—they both recognize in each other predators who have transcended their original nature. Their rare encounters are marked by elaborate courtesy masking mutual assessment, each looking for weaknesses in the other while sharing an unspoken appreciation for their respective arts of extraction.",
  "tags": ["LeBlanc", "Black Rose", "Ryze", "Vladimir", "Immortals", "Ancient Encounters", "Rivals"],
  "source": "Theoretical Extended Universe",
  "relationships": [
    {
      "entity": "LeBlanc",
      "type": "Complex Association",
      "description": "Evelynn and LeBlanc have a long history of occasional encounters spanning millennia, marked by mutual recognition of each other's inhuman nature and occasional exchanges of information."
    },
    {
      "entity": "Ryze",
      "type": "Adversary",
      "description": "The arcane mage Ryze has clashed with Evelynn multiple times throughout history, each encounter ending in stalemate."
    },
    {
      "entity": "Vladimir",
      "type": "Fellow Predator",
      "description": "Evelynn and Vladimir share a predatory nature and mutual respect, though their feeding methods differ significantly."
    }
  ]
},
{
  "champion": "Evelynn",
  "type": "Extended History",
  "title": "Modern Hunting Grounds",
  "text": "In the current era, Evelynn has adapted her hunting methods to exploit the complexities of modern Runeterran society. The bustling city-states offer rich hunting grounds with diverse prey, while improved transportation between regions allows her to evade those who might recognize her pattern of predation.\n\nPiltover and Zaun have become particular favorites of hers in recent decades. The stark division between the wealthy upper city and the desperate undercity creates perfect conditions for her hunts. In Piltover, she adopts the guise of an exotic foreign investor or artist, targeting wealthy industrialists and hextech pioneers whose disappearances are often attributed to business rivals or accidents in experimental workshops. In Zaun, she appears as a shimmer dealer or gang leader from a neighboring territory, eliminating troublesome chem-barons whose deaths are dismissed as part of the constant power struggles in the undercity.\n\nThe rapid development of hextech has presented both opportunities and challenges for Evelynn. The technology has created new forms of communication and transportation that make information about suspicious disappearances spread faster than before. However, it has also created new vulnerabilities in human society—people increasingly isolated by technology, connecting with strangers through hextech communication devices, creating perfect opportunities for a predator who knows how to exploit such systems.\n\nBeyond the urban centers, Evelynn has found the ongoing tensions between Noxus and Demacia to be particularly useful. Border villages and disputed territories offer hunting grounds where disappearances can be blamed on enemy action or wartime desertion. She has perfected a technique of appearing as a refugee from the opposing side, using the inherent sympathy such a disguise generates to lower her victims' defenses.\n\nMost recently, Evelynn has been observed with increasing frequency near sites of celestial activity—locations where the Aspect forces of Targon or the Void have manifested. Some scholars of demonic lore suggest she may be drawn to these sites due to the intense emotions they generate, while others propose a more troubling theory: that ancient demons like Evelynn may sense coming changes in Runeterra's magical ecosystem and are positioning themselves to exploit whatever cataclysm might be on the horizon.",
  "tags": ["Modern Era", "Piltover", "Zaun", "Hextech", "Noxus-Demacia Conflict", "Celestial Activity"],
  "source": "Theoretical Extended Universe",
  "relationships": [
    {
      "entity": "Piltover",
      "type": "Hunting Ground",
      "description": "Evelynn frequents Piltover disguised as a foreign investor or artist, targeting wealthy hextech pioneers."
    },
    {
      "entity": "Zaun",
      "type": "Hunting Ground",
      "description": "In Zaun, Evelynn poses as a shimmer dealer or rival gang leader to eliminate chem-barons."
    },
    {
      "entity": "Celestial Forces",
      "type": "Subject of Interest",
      "description": "Evelynn has recently shown interest in sites of celestial activity, possibly sensing coming changes in Runeterra's magical balance."
    }
  ]
},
{
  "champion": "Evelynn",
  "type": "Extended Abilities",
  "title": "Shadow Arts of the Agony's Embrace",
  "text": "While Evelynn's primary abilities are well documented, her long existence has allowed her to develop numerous specialized applications of her shadow magic that she employs selectively based on the situation and prey.\n\nOne of her more subtle techniques is what shadow magic researchers have termed \"emotional leeching.\" Rather than causing physical pain directly, this ability allows Evelynn to gradually drain positive emotions from her target, replacing joy, hope, and love with creeping despair and anxiety. The process is so gradual that victims often believe they are simply falling into natural depression or emotional fatigue. Evelynn uses this technique to prepare high-value targets over weeks or months, weakening their emotional resilience before the final, physical hunt begins.\n\nAnother specialized ability is her \"shadow anchoring,\" which allows her to leave a fragment of her essence within a location where intense suffering has occurred. These shadow anchors can remain dormant for years or even decades, allowing her to instantaneously return to that location when conditions are favorable. Witness accounts describe her seemingly materializing from within shadows that suddenly deepen and expand beyond natural proportions. Evelynn has created dozens of these anchors throughout Runeterra, giving her an escape network that spans the continent.\n\nPerhaps most insidious is her ability to create \"desire phantoms\"—shadow constructs that appear as whatever a specific target most desires. Unlike her usual hunting technique of adopting a generally appealing form, desire phantoms are precisely tailored to a single victim, appearing as lost loved ones, idealized romantic partners, or even embodiments of abstract concepts like fame or power. These phantoms have limited autonomy and cannot stray far from Evelynn herself, but they allow her to simultaneously manipulate multiple victims in complex scenarios.\n\nIn moments of true danger, Evelynn has occasionally demonstrated the ability to temporarily convert her entire form into living shadow, becoming completely intangible. This state can only be maintained for brief periods and leaves her unable to feed or interact with the physical world, but it renders her immune to most forms of attack. Only weapons imbued with specific types of magic—particularly those drawing on celestial power or light magic—have any hope of affecting her in this form.",
  "tags": ["Shadow Magic", "Advanced Techniques", "Emotional Manipulation", "Shadow Anchors", "Desire Phantoms", "Intangibility"],
  "source": "Theoretical Extended Universe",
  "relationships": []
},
{
  "champion": "Evelynn",
  "type": "Historical Event",
  "title": "The Feast at Urtis",
  "text": "The climactic battle that marked Evelynn's full transformation from shadow entity to demon occurred at the forgotten city of Urtis during the final days of the last Rune War. Once a prosperous center of learning situated in what is now the border region between Demacia and Noxus, Urtis became the site of a catastrophic conflict when two rival mages unleashed World Runes against each other within its walls.\n\nThe resulting magical cataclysm tore open the boundaries between realms, creating a maelstrom of arcane energy that destroyed the city and everyone in it. The pain of thousands of deaths—not quick merciful ends, but slow, agonizing dissolutions as magic unmade flesh and spirit alike—created a nexus of suffering unlike anything the proto-Evelynn had experienced before.\n\nDrawn to this wellspring of agony, the shadow entity that would become Evelynn immersed itself fully in the dying moments of Urtis. For three days and nights, the shadows themselves seemed to writhe and pulse around the ruined city as the entity gorged itself on the unprecedented feast of torment. Witnesses from nearby settlements reported hearing impossible screams echoing from the ruins long after everyone in Urtis should have been dead.\n\nOn the dawn of the fourth day, the screams fell silent. From the still-smoking ruins emerged a figure that appeared almost human—a beautiful woman with strange colored skin and eyes that glowed with unnatural light. As she walked away from Urtis, plants withered beneath her feet, and small animals fell dead in her path, their tiny forms contorted in inexplicable agony.\n\nEvelynn had fully manifested at last. The ruins of Urtis remained magically contaminated for centuries afterward, avoided by travelers and considered cursed by local populations. Even today, nothing grows there, and those who camp within the broken foundations report vivid nightmares of being flayed alive while a beautiful woman watches with pleasure.\n\nIn the centuries since, Evelynn has occasionally returned to Urtis on the anniversary of its destruction, not to feed—for there is little suffering to be had there now—but perhaps in a demon's approximation of nostalgia or pilgrimage. It was the place of her true birth, the site where she first understood what she was and what she would forever crave.",
  "tags": ["Rune Wars", "Transformation", "Magical Cataclysm", "Birth of Demon", "Cursed Location"],
  "source": "Theoretical Extended Universe",
  "relationships": [
    {
      "entity": "Urtis",
      "type": "Significant Location",
      "description": "The now-destroyed city where Evelynn completed her transformation into a fully manifested demon during the final days of the last Rune War."
    }
  ]
}
]

